In [1]:
import pandas as pd
import numpy as np

In [2]:
df1=pd.DataFrame({'city':['Mumbai','Kolkata','Pune'],
                'windspeed':[27,30,32]
                ,'temperature':[34,29,30]})
df1

      city  windspeed  temperature
0   Mumbai         27           34
1  Kolkata         30           29
2     Pune         32           30

In [3]:
df2=pd.DataFrame({'city':['Mumbai','Kolkata','Pune'],
                'humidity':[33,28,31]})
df2

      city  humidity
0   Mumbai        33
1  Kolkata        28
2     Pune        31

In [4]:
df_new=pd.concat([df1,df2],keys=['df1','df2'])
df_new

          city  windspeed  temperature  humidity
df1 0   Mumbai       27.0         34.0       NaN
    1  Kolkata       30.0         29.0       NaN
    2     Pune       32.0         30.0       NaN
df2 0   Mumbai        NaN          NaN      33.0
    1  Kolkata        NaN          NaN      28.0
    2     Pune        NaN          NaN      31.0

In [5]:
df_new.duplicated()

df1  0    False
     1    False
     2    False
df2  0    False
     1    False
     2    False
dtype: bool

In [5]:
df_new.set_index('city',inplace=True)
df_new

         windspeed  temperature  humidity
city
Mumbai        27.0         34.0       NaN
Kolkata       30.0         29.0       NaN
Pune          32.0         30.0       NaN
Mumbai         NaN          NaN      33.0
Kolkata        NaN          NaN      28.0
Pune           NaN          NaN      31.0

If the city values are not matching use index argument while creating df and it will help to align

# This index issue has been handled by Merge function in Pandas

In [6]:
df_new

         windspeed  temperature  humidity
city
Mumbai        27.0         34.0       NaN
Kolkata       30.0         29.0       NaN
Pune          32.0         30.0       NaN
Mumbai         NaN          NaN      33.0
Kolkata        NaN          NaN      28.0
Pune           NaN          NaN      31.0

In [13]:
df_new['windspeed'].value_counts()

windspeed
27.0    1
30.0    1
32.0    1
Name: count, dtype: int64

In [14]:
df_new.reset_index

<bound method DataFrame.reset_index of          windspeed  temperature  humidity
city
Mumbai        27.0         34.0       NaN
Kolkata       30.0         29.0       NaN
Pune          32.0         30.0       NaN
Mumbai         NaN          NaN      33.0
Kolkata        NaN          NaN      28.0
Pune           NaN          NaN      31.0>

In [16]:
df_new.reset_index(inplace=True)
df_new

      city  windspeed  temperature  humidity
0   Mumbai       27.0         34.0       NaN
1  Kolkata       30.0         29.0       NaN
2     Pune       32.0         30.0       NaN
3   Mumbai        NaN          NaN      33.0
4  Kolkata        NaN          NaN      28.0
5     Pune        NaN          NaN      31.0

In [19]:
df_new['city'].value_counts()

city
Mumbai     2
Kolkata    2
Pune       2
Name: count, dtype: int64

In [21]:
df=pd.DataFrame({'A':[1,2,3,4,2,3],
                          'B':['a','b','c','d','b','c']})
df

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  2  b
5  3  c

In [22]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

# Convert the duplicated values in dataframe- takes True Values

In [23]:
duplicated=df[df.duplicated()]
duplicated

   A  B
4  2  b
5  3  c

In [24]:
duplicated.reset_index(drop=True) # drop=True helps to remove the old index

   A  B
0  2  b
1  3  c

In [25]:
df.nunique()

A    4
B    4
dtype: int64

In [27]:
df.isnull().sum()

A    0
B    0
dtype: int64

In [30]:
df.isna().any().astype(int)

A    0
B    0
dtype: int64